Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བྱུང་བའི་དྲི་ཞིམ་པོ་ཚོར་ནས། འཁོར་རྒྱ་མཚོ་ཕུན་སུམ་ཚོགས་པ་མཐའ་ཡས་པ་མཐོང་སྟེ། ཁྱིམ་དང་གཞལ་མེད་ཁང་གི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་མི་འཕྲོགས་པ་མཐོང་ནས་ཡོན་ཏན་རྒྱ་མཚོ་ཚད་མེད་པ་ཁོང་དུ་ཆུད་དེ། དགེ་བསྙེན་མ་མི་གཡོ་བ་ལ་ཚིགས་སུ་བཅད་པ་འདིས་བསྟོད་དོ། །ཁྱོད་ཀྱིས་རྟག་ཏུ་ཚུལ་ཁྲིམས་དྲི་མེད་ཡོངས་བསྲུངས་ཏེ། །
en: He smelled the lovely scent that arose from all her pores, saw the infinite perfect assembly of her attendants, saw the perfect, unassailable display of the aerial palace that was her home, perceived the measureless ocean of its qualities, and praised the upāsikā Acalā with this verse: “You continually maintain a stainless good conduct.

source: བཟོད་པ་ཤིན་ཏུ་ཡངས་པའང་ཡོངས་སུ་བསྒོམས་མཛད་ཅིང་། །
en: You are completely pervaded by vast patience.

source: བརྩོན་འགྲུས་བརྟན་པ་རྡོ་རྗེ་ལྟ་བུ་བསྒྲུབས་པས་ན། །
en: You are established in diligence as firm as a vajra.

source: རི་བོའི་རྒྱལ་པོ་ལྟ་བུར་འགྲོ་བར་འཕགས་ཤིང་འབར། །
en: You are superior among beings like the shining lord of mountains.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། དགེ་བསྙེན་མ་མི་གཡོ་བ་ལ་ཚིགས་སུ་བཅད་པ་དེས་མངོན་པར་བསྟོད་དེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། །ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: {1} After Sudhana, the head merchant’s son, had praised the upāsikā Acalā with that verse, he said to her, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བས། བྱང་ཆུབ་སེམས་དཔའི་ངག་འཇམ་ཞིང་ཡིད་དུ་འོང་ལ་ཉམས་སུ་བདེ་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་དགའ་བར་འགྱུར་བའི་ཚིག་ཏུ་བརྗོད་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །
en: The upāsikā Acalā spoke with a gentle, beautiful, delightful voice to Sudhana, the head merchant’s son, with words that brought him joy, saying, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་སྙིང་པོ་ཐོབ་བ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation called the essence of wisdom that is difficult to attain.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་ཡི་དམ་བརྟན་པ་ལ་སློབ་པ།
en: I train in the gateway of bodhisattva conduct that possesses a strong commitment.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་སའི་གཟུངས་ཀྱི་སྒོ་ཐོབ་པའོ། །ཁོ་མོ་ནི་སྦོས་པའི་ཡེ་ཤེས་སྣང་བ། ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བར་བརྗོད་པ་ཐོབ་པའོ། །
en: I have attained the gateway of the power of retention of the level of the equality of all phenomena.

source: ཁོ་མོ་ནི་ཆོས་ཐམས་ཅད་ཡོང་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐོབ་བའོ། །
en: I have attained the gateway called the light of the wisdom of eloquence that elucidates the basis of all phenomena, and I have attained the gateway of the samādhi called the display of the tireless search for the Dharma.”

source: སྨྲས་པ་འཕགས་མ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་དེའི་ཡུལ་ནི་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana asked, “Āryā, what is the scope of the bodhisattva liberation called the essence of the wisdom that is difficult to attain?

source: ཡི་དམ་ལ་བརྟན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་སའི་གཟུངས་ཀྱི་སྒོ་དང་། ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བར་བརྗོད་པའི་སྤོབས་པ་སྣང་བའི་སྒོ་དང་། ཆོས་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོའི་ཡུལ་ནི་ཇི་ལྟ་བུ་ཞིག་མཆིས། སྨྲས་པ།
en: What is the scope of the gateway of bodhisattva conduct with a strong commitment, of the gateway of maintaining the level of the equality of all phenomena, of the gateway of the light of the wisdom of eloquence that elucidates the basis of all phenomena, and of the gateway of the samādhi called the display of the tireless search for the Dharma?”

source: རིགས་ཀྱི་བུ་གནས་འདི་ནི་ཡིད་ཆེས་པར་དཀའོ། །སྨྲས་པ་འཕགས་མ་བསྟན་དུ་གསོལ། སངས་རྒྱས་ཀྱི་བྱིན་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་ན་ཡིད་ཆེས་པར་མཆི་གྲང་། རྟོགས་པ་དང་འཚལ་བ་དང་། རྣམ་པར་རྟོགས་པ་དང་།
en: Acalā answered, “Noble one, this is a subject that is difficult to believe.”

source: རྗེས་སུ་རྟོགས་པ་དང་།
en: Sudhana said, “Āryā, please teach me.

source: རིག་པ་དང་། དམིགས་སུ་ཕེབས་པ་དང་། གོམས་པ་དང་། མི་འགལ་བ་དང་། རྣམ་པར་མི་རྟོག་པ་དང་། སྒྲོ་འདོགས་པ་མ་མཆིས་པ་དང་།
en: Through the power of the buddhas and being in the care of the kalyāṇamitras, I will believe it, comprehend it, know it, understand it, discern it, cognize it, reflect upon it as a focus of my attention, contemplate it, not deny it, not conceptualize it, not add to it, and be in accord with it.”

source: མཉམ་པར་བགྱིད་པར་ཡང་མཆི་གྲང་། དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་ཤིག་ན་དྲི་མ་མེད་པའི་འོད་ཀྱི་བསྐལ་པ་ལ། དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Then the upāsikā Acalā said to Sudhana, the head merchant’s son, “Noble one, in the past, during a kalpa called Stainless Light, appeared the tathāgata named Pralambabāhu.

source: ཁོ་མོ་ཡང་དེའི་ཚེ་རྒྱལ་པོ་གློག་གིས་བྱིན་པའི་བུ་ཅིག་མ་ཞིག་ཏུ་གྱུར་ནས།
en: At that time I was the only daughter of King Vidyuddatta.

source: དེའི་ཚེ་ནུབ་མོ་མི་ཉལ་ཙམ་ཞིག་ན་རྒྱལ་པོའི་སྒོ་ཡང་བཅད། ཕ་དང་མ་ཡང་ཉལ། སྐྱེས་བ་དང་བུད་མེད་དག་ཀྱང་གཉིད་ཀྱིས་ལོག །རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བའི་སྒྲ་ཡང་ཞི། ལྷན་ཅིག་སྤྱོད་པའི་བུད་མེད་ལྔ་བརྒྱ་ཙམ་དག་ཀྱང་ཉལ་བར་གྱུར་བ་ཞིག་ན། ཁོ་མོ་མལ་གྱི་སྟེང་ན་འདུག་ཅིང་།
en: One night when I was not sleeping, the door of the royal residence was shut, my parents were asleep, the staff of men and women had gone to sleep, the sound of music being played had ceased, and the five hundred women that I spent time with were sleeping, I sat on my bed, looking at the constellations of stars in the sky.

source: ནམ་མཁའི་དབྱིངས་ལ་རྒྱུ་བའི་སྐར་མའི་ཚོགས་ཀྱི་ཕྲེང་བ་རྣམ་པར་འཁོད་པ་ལ་ལྟ་ལྟ་བ་ལས། སྟེང་གི་བར་སྣང་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕྱག་རབ་ཏུ་བརྐྱང་བ། རིའི་དབང་པོ་རི་རབ་ལྟར་ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: In the sky above I saw the Tathāgata Arhat Samyak­saṃbuddha Pralambabāhu, who was like Sumeru, the lord of mountains.

source: དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་མང་པོས་བསྐོར་བ།
en: He was accompanied by an entourage of many nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་གྲངས་མེད་པས་ཡོངས་སུ་བསྐོར་བ། ཕྱོགས་ཐམས་ཅད་དུ་འོད་ཟེར་གྱི་དྲ་བ་ཐོགས་པ་མེད་པས་རྒྱས་པར་ཁྱབ་པའི་སྐུ་བཞུགས་པ་མཐོང་ངོ་། །
en: His body spread a network of unimpeded light rays throughout all directions.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སྐུའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཀྱང་དྲི་ཞིམ་པོ་རྣམ་པ་འདི་ལྟ་བུ་བྱུང་སྟེ། དེས་ཁོ་མོའི་ལུས་དང་སེམས་ཤིན་ཏུ་བདེ་བར་གྱུར། ཡིད་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: From all the pores of the tathāgata’s body came a beautiful scent that brought ease to my mind and body and great happiness to my mind.

source: མལ་གྱི་སྟེང་ནས་ལངས་ནས་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ་ས་ལ་བབས་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་བ་དེ་ལ་ཕྱག་འཚལ་ཏེ།
en: “I arose from my bed and stood on the floor, and with my ten fingers placed together in homage, I bowed down to the Tathāgata Pralambabāhu.

source: དེའི་སྤྱི་གཙུག་ལ་བལྟས་ནའང་། མཐར་ཐུག་པར་མ་རུང་། གཡས་གཡོན་གྱི་ཚད་ཀྱང་ཟིན་པར་མ་རུང་།
en: As I looked at the crown of his head there seemed to be no end to it, and I could not grasp his extent to the right or left.

source: མཚན་དང་དཔེ་བྱད་ཕུན་སུམ་ཚོགས་པ་ལ་བསམས་ནའང་ངོམས་པར་མ་རུང་སྟེ།
en: I could never have enough of contemplating his perfect signs and features of a great being.

source: དེའི་ཚེ་ཁོ་མོ་འདི་སྙམ་དུ་བསམས་སོ། །ལས་ཇི་ལྟ་བུ་ཞིག་བྱས་ན་ལུས་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ནི་འཐོབ་པར་འགྱུར།
en: “At that time, I wondered, ‘Through what kind of karma can one obtain such a perfect body?

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཕུན་སུམ་ཚོགས་པ་ནི་སྐྱེ་བར་འགྱུར།
en: Give rise to the perfect signs and features of a great bring?

source: འོད་ཀྱི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་ནི་འབྱུང་བར་འགྱུར།
en: Have such a perfect display of light?

source: འཁོར་ཕུན་སུམ་ཚོགས་པ་ནི་འགྲུབ་པར་འགྱུར།
en: Attain such a perfect entourage?

source: ཡིད་ཀྱི་རང་བཞིན་གྱི་གནས་དང་། ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་ནི་འབྱུང་བར་འགྱུར།
en: Have such a perfect residence and requisites that are of the nature of the mind?

source: བསོད་ནམས་ཕུན་སུམ་ཚོགས་པ་ནི་སྐྱེ་བར་འགྱུར།
en: Develop such a perfection of merit?

source: ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ནི་རྣམ་པར་དག་པར་འགྱུར།
en: Have such purified wisdom?

source: ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཕུན་སུམ་ཚོགས་པ་ནི་ཡང་དག་པར་འགྲུབ་པར་འགྱུར།
en: Attain such perfect, inconceivable miracles from samādhi?

source: གཟུངས་ཕུན་སུམ་ཚོགས་པ་ནི་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: Complete such perfect powers of retention?

source: སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་ནི་དབང་དུ་འགྱུར་སྙམ་པ་དང་།
en: And have the power of such perfect eloquence?’

source: རིགས་ཀྱི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་བ་དེས་ཁོ་མོའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་དེས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བུ་མོ་ཁྱོད་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་གཞོམ་པའི་ཕྱིར་ཐུབ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །
en: “Noble one, the Bhagavat Tathāgata Pralambabāhu knew my thought and said, ‘Girl, develop an invincible motivation for the defeat of all the kleśas.

source: མངོན་པར་ཞེན་པ་ཐམས་ཅད་བསལ་བའི་ཕྱིར་ཕམ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །
en: Develop an undefeatable motivation for eliminating all attachment.

source: ཆོས་ཟབ་མོའི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཞུམ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །
en: Develop an unwearying motivation for comprehending the way of the profound Dharma.

source: སེམས་ཅན་བསམ་པ་མི་ཟད་པ་དང་ལྡན་པའི་རྒྱ་མཚོའི་ཀློང་དུ་ལྟུང་བས་མི་སྒུལ་བའི་སེམས་སྐྱེད་ཅིག །
en: Develop an unshakable motivation for descending into the whirling ocean of the range of the thoughts of beings.

source: སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་སྐྱེ་བའི་སྐྱེ་མཆེད་དུ་མགོ་རྨོངས་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །
en: Develop an unconfused motivation for the rebirth in all the states of existence within saṃsāra.

source: སངས་རྒྱས་ཐམས་ཅད་བལྟ་བར་མོས་པ་རྒྱུན་མི་གཅད་པའི་ཕྱིར་ངོམས་མི་ཤེས་པའི་སེམས་སྐྱེད་ཅིག །
en: Develop a never-satisfied motivation for the continuous aspiration to see all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཆོག་མི་ཤེས་པའི་སེམས་སྐྱེད་ཅིག །
en: Develop a never-satiated motivation in order to obtain the clouds of Dharma of all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་སྣང་བ་རྟོགས་པར་བྱ་བའི་ཕྱིར་ངེས་པར་རྟོགས་པའི་སེམས་སྐྱེད་ཅིག །
en: Develop a realized motivation in order to realize the light of the way of the Dharma of all the buddhas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་གཟུང་བའི་ཕྱིར་ཡང་དག་པར་གཟུང་བའི་སེམས་སྐྱེད་ཅིག །
en: Develop an acquisitive motivation for acquiring the Dharma wheels of all the buddhas.

source: དེ་བཞིན་གཤེགས་པའི་ཞལ་ནས་བྱུང་བ་ཤེས་པར་བྱ་བ་ལྟ་ལ་ཅི་སྨོས་ཀྱི་ཆུང་ངུ་ན་བརྡར་བྱེད་པ་ཙམ་ལ་ཡང་འཁྲུལ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །
en: Develop a motivation to be without delusion concerning even a small gesture, let alone to know that which comes from a tathāgata’s mouth.

source: བུ་མོ་ཁྱོད་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་རིན་པོ་ཆེན་རྣམ་པར་དབྱེ་བའི་ཕྱིར། རྣམ་པར་དབྱེ་བའི་སེམས་སྐྱེད་ཅིག་ཅེས་བྱུང་སྟེ།
en: Girl, you should develop the motivation to distribute the precious Dharma in accordance with the aspirations of beings.’

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་མོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕྱག་རབ་ཏུ་བརྐྱང་བ་ལས། ཆོས་ཀྱི་ཚུལ་གྱི་གདམས་ངག་གི་སྒོ་རྣམ་པ་དེ་ལྟ་བ་དག་ཐོས་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ནི་མངོན་པར་མོས་པར་གྱུར།
en: “Noble one, I heard from the Bhagavat Tathāgata Arhat Samyak­saṃbuddha Pralambabāhu, that king of the gateways of instruction to the way of the Dharma, and I longed to attain omniscient wisdom.

source: སྟོབས་བཅུའི་རང་བཞིན་ལ་ནི་མངོན་པར་སྨོན་པར་གྱུར།
en: I aspired to the nature of the strengths.

source: སངས་རྒྱས་གསུང་ལ་ནི་མངོན་པར་དད་པར་གྱུར།
en: I wished for the words of the Buddha.

source: སངས་རྒྱས་ཀྱི་འོད་ཀྱི་རྒྱན་ནི་ཡོངས་སུ་སྦྱང་བར་དགའ།
en: I wanted to have the purified display of light of a buddha.

source: སངས་རྒྱས་ཀྱི་སྐུ་ཕུན་སུམ་ཚོགས་པ་ནི་ཡོངས་སུ་བསྒྲུབ་པར་དགའ།
en: I wanted to attain the perfect body of a buddha.

source: སངས་རྒྱས་ཀྱི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་རྣམ་པར་དག་པ་ལ་ནི་མངོན་པར་མོས་པར་གྱུར།
en: I longed to have a buddha’s pure signs and features of a great being.

source: སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་མངོན་པར་སྨོན་པར་གྱུར།
en: I aspired to have the perfect assembly of followers of a buddha.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་ལ་ནི་མངོན་པར་དད་པར་གྱུར།
en: I wished for the pure realms of a buddha.

source: སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་མངོན་པར་མོས་པར་གྱུར།
en: I longed for the perfect conduct of a buddha.

source: སངས་རྒྱས་ཀྱི་སྐུ་ཚེའི་ཚད་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་མངོན་པར་དགའ་ནས།
en: I rejoiced in the perfect lifespan of a buddha.

source: རྡོ་རྗེ་ལྟར་རི་དང་མཚོན་ཅ་ཐམས་ཅད་ཀྱི་མཐུས་ཐུབ་པར་དཀའ་བའི་སེམས་ཉོན་མོངས་པ་ཐམས་ཅད་དང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་ཕྱེད་མི་ཚུགས་པ་བསྐྱེད་དེ།
en: I had developed the motivation that could not be impaired by all the kleśas or by the śrāvakas and pratyeka­buddhas, which like a vajra could not be defeated even by the strength of all mountains and weapons.

source: རིགས་ཀྱི་བུ་དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སེམས་བསྐྱེད་པ་དེའི་མཐུས་བསྐལ་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་ཡིད་ཀྱི་དགུ་ལས་ཀྱང་འདོད་པ་ལ་སྤྱད་པར་ཡང་མི་དྲན་ན། གཉིས་ཀྱིས་གཉིས་འདུ་བ་ལྟ་ཅི་སྨོས།
en: “Noble one, from that time until now, through the power of having developed that motivation, throughout as many kalpas as there are atoms in Jambudvīpa, I do not remember ever in my mind enjoying pleasures, let alone copulation.

source: རིགས་ཀྱི་བུ་དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་རང་གི་གཉེན་བཤེས་ལའང་ཁོང་ཁྲོ་བའི་སེམས་ཅིག་མ་བསྐྱེད་ན། དེ་མ་ཡིན་པའི་སེམས་ཅན་མ་ཉེས་པའི་གཞན་ལྟ་ཅི་སྨོས།
en: “Noble one, from that time until now, I have never had one thought of anger toward a kalyāṇamitra, let alone offended any other being.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་བདག་ཏུ་ལྟ་བ་དང་། ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་ཡང་བསྐྱེད་པར་མི་དྲན་ན། དེ་མ་ཡིན་པའི་ཡོ་བྱད་གཞན་ལ་བདག་གིར་བྱས་ཏེ། མངོན་པར་ཆགས་པ་ལྟ་ཅི་སྨོས།
en: “Noble one, from that time until now, I do not remember having ever given rise to a single thought that holds the view that there is a self, let alone having attachment to things that I think of as being mine.

source: ཤི་འཕོ་བ་དང་མངལ་ན་གནས་པའི་ཚེའང་སེམས་རྨོངས་པའམ། འདུ་ཤེས་སྣ་ཚོགས་སམ། ལུང་དུ་མ་བསྟན་པའི་སེམས་ཀྱང་བྱུང་དུ་མི་དྲན་ན། ལེགས་པར་བསམས་ཤིང་གནས་པ་ལྟ་ཅི་སྨོས།
en: “Even when I died and was reborn inside a womb, I do not remember being in a state of stupidity, having various concepts, or having a neutral state of mind, let alone having a state of mental fixation.

source: བསྐལ་པ་དེ་སྙེད་ཅིག་ཏུ་སངས་རྒྱས་གཅིག་ཀྱང་ཆུང་ངུ་ན་རྨི་ལམ་དུ་མཐོང་བའི་རྣམ་པར་དམིགས་པར་ཡང་བརྗོད་དུ་མི་དྲན་ན། བྱང་ཆུབ་སེམས་དཔའི་མིག་བཅུས་མཐོང་བར་གྱུར་པ་ལྟ་ཅི་སྨོས།
en: “Throughout those kalpas I do not remember ever forgetting seeing a buddha, even down to the perception of the sight of a buddha in a dream, let alone the perception of the visual images of the ten levels of bodhisattvas.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡང་དག་པར་འཛིན་ཀྱང་ཆུང་ངུ་ན་མྱིང་དུ་བྱ་བའི་ཆོས་ཀྱི་ཚིག་དང་། ཡི་གེ་གཅིག་ཀྱང་བརྗོད་པར་མི་དྲན་ན། དེ་བཞིན་གཤེགས་པའི་ཞལ་གྱི་མཛོད་ནས་བྱུང་བ་ལྟ་ཅི་སྨོས།
en: “From that time until now, while holding the clouds of Dharma of all the tathāgatas, I do not remember forgetting in my mind even a single word or term of the Dharma, even down to a single syllable, let alone what has emerged from the treasure of the mouths of the tathāgatas.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་ཆོས་ཀྱི་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་འཐུང་འཐུང་ཡང་། ཆུང་ངུ་ན་འཇིག་རྟེན་པའི་ཆོས་རྣམས་ལ། ཚིག་འགའ་འང་མ་བསམས་མ་བརྟགས་པར་མི་དྲན་ནོ། །
en: “From that time until now, while I drank and drank from the ocean of the Dharma, I do not remember ever ignoring and not contemplating even any words of the worldly Dharmas.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་དེ་སྙེད་ཅིག་གི་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལས་ཀྱང་། ཆུང་ངུ་ན་འཇིག་རྟེན་པའི་བཟོའི་རྒྱུས་དང་། ཚུལ་ཡང་རུང་སྟེ། ཆོས་ཀྱི་ཚུལ་གྱི་སྒོ་གང་ལ་ཡང་ཁོ་མོས་ཏིང་ངེ་འཛིན་མངོན་པར་མ་བསྒྲུབས་པ་དེ་ལྟ་བུ་མེད་དོ། །
en: “From that time until now, I do not remember not accomplishing the samādhi of a single gateway to the ways of the Dharma from among the ocean of the ways of the Dharma, even down to the ways of the knowledge of worldly crafts.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་དེ་བཞིན་གཤེགས་པ་དེ་སྙེད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་བཟུང་ཡང་ཇི་ལྟར་ཡོངས་སུ་བཟུང་བ་ལས་སེམས་ཅན་འདུལ་བའི་དབང་དུ་བྱ་བ་མ་གཏོགས་པར་ཆུང་ངུ་ན་རྗེས་སུ་བརྒྱུད་པའི་རྒྱུས་ཙམ་གྱི་ཚིག་དང་། ཡི་གེ་འགའ་ཡང་བོར་བར་མི་དྲན་ནོ། །
en: “From that time until now, while I held the wheels of Dharma of the tathāgatas in order to guide beings, I do not remember leaving out a single word or even a single syllable that was transmitted to me.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སངས་རྒྱས་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་མཐོང་ཡང་ཆུག་ཆུང་ངུ་ན་སྤྲུལ་པའི་སངས་རྒྱས་ཀྱི་སྨོན་ལམ་གྱི་རྒྱུད་ཀྱང་རུང་སྟེ། སྨོན་ལམ་འགའ་ཡང་ཁོ་མོས་སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར། མངོན་པར་མ་བསྒྲུབས་པ་མེད་དོ། །
en: “From that time until now, there is not a single prayer from the ocean of the visions of buddhas that I have not accomplished in order to purify the ocean of beings, even down to carrying out the prayer of a buddha who was an emanation.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སངས་རྒྱས་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་གི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ལས། བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་འགའ་ཙམ་ཡང་ཁོ་མོས་བདག་གི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་པར་མ་བསྒྲུབས་པ་དེ་ལྟ་བུ་མི་དྲན་ནོ། །དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སེམས་ཅན་གང་ཁོ་མོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མ་བསྐུལ་བ་དེ་ལྟ་བུ་གཅིག་ཀྱང་མིག་ལམ་དུ་འོང་པར་མི་དྲན་ནོ། །
en: “From that time until now, I do not remember not practicing any bodhisattva conduct from the ocean of the past bodhisattva conduct of the ocean of buddhas in order to purify my conduct.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་མངོན་པར་བསྒྲུབས་སུ་མི་དྲན་ནོ། །
en: “From that time until now, I do not remember creating a single motivation that was focused on being a śrāvaka or a pratyeka­buddha.

source: རིགས་ཀྱི་བུ་དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་བསྐལ་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ལོན་ཡང་ཚིག་དང་། ཡི་གེ་འགའ་ལ་ཡང་ཐེ་ཚོམ་བསྐྱེད་པའམ། གཉིས་ཀྱིས་འདུ་ཤེས་སམ། རྣམ་པར་རྟོག་པའི་འདུ་ཤེས་སམ། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་སམ། རབ་ཀྱི་འདུ་ཤེས་སམ། བཟང་ངན་གྱི་འདུ་ཤེས་སམ།
en: “Noble one, from that time until now, throughout as many kalpas as there are atoms in Jambudvīpa, I do not remember ever having given rise to doubts, dualistic identification, conceptualized identification, variegated identification, obdurate identification, identification as inferior, or identification as appropriate or inappropriate concerning any single word or syllable.

source: སྡུག་མི་སྡུག་གི་འདུ་ཤེས་བསྐྱེད་དུ་མ་དྲན་ནོ། །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེ་ཕྱིན་ཅད་དུ་སངས་རྒྱས་བྱུང་བ་དང་མ་བྲལ་ལོ། །
en: “Noble one, since that time, I have never been separated from the appearance of a buddha.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the buddha bhagavats.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the bodhisattvas.

source: ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the true kalyāṇamitras.

source: སངས་རྒྱས་ཀྱི་སྨོན་ལམ་ཐོས་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from hearing the prayers of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐོས་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from hearing of the conduct of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་ཐོས་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from hearing the way of the perfections of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སའི་ཡེ་ཤེས་སྣང་བའི་ཚུལ་ཐོས་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from hearing the way of the light of the wisdom of the level of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་དང་ཏིང་ངེ་འཛིན་མི་ཟད་པའི་མཛོད་དང་།
en: I have never been separated from the attainment of hearing the inexhaustible treasures and treasuries of the retentions and samādhis of the bodhisattvas.

source: གཏེར་ཐོས་པ་ཐོབ་པ་དང་མ་བྲལ་ལོ་མཐའ་དང་དབུས་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དྲ་བ་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཚུལ་ཐོས་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from hearing of the comprehension of and entry into the centerless and endless network of world realms.

source: མཐའ་དང་དབུས་མེད་པའི་སེམས་ཅན་གྱི་ཁམས་འབྱུང་བའི་རྒྱུ་ཐོས་པ་ཐོབ་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the attainment of hearing the causes for the arising of the centerless and endless realms of beings.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་དྲ་བའི་དཀྱིལ་འཁོར་ཡོངས་སུ་ཟད་པར་བྱ་བའི་ཡེ་ཤེས་སྣང་བ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the light of the wisdom of the cessation of the domain of the network of the kleśas of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་འབྱུང་བའི་རྒྱུའི་ཡེ་ཤེས་ཐོབ་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the attainment of the wisdom of the causes that give rise to the roots of merit of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་ཡོངས་སུ་སྟོན་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the manifestation of bodies in accordance with the aspirations of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤེས་པར་བྱེད་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ་དང་མ་བྲལ་ལོ། །
en: I have never been separated from the pure domain of the speech that brings knowledge to all beings.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྒོ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་འདི་དང་། ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་འདི་ལ་སྙོམས་པར་ཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་ཡི་དམ་ལ་བརྟན་པ་འདི་རྣམ་པར་ཕྱེ་བ་དང་། གཟུངས་ཀྱི་སྒོ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱིས་འདི་དང་། སྤོབས་པའི་ཡེ་ཤེས་སྣང་བའི་སྒོ་ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བར་བརྗོད་པ་འདི་རྣམ་པར་ཕྱེ་བ་དང་།
en: “Noble one, I have accomplished this gateway of the bodhisattva liberation called the essence of the wisdom that is difficult to attain and the gateway of the samādhi called the display of the tireless search for the Dharma; I have reflected on the gateway to bodhisattva conduct with a firm commitment; I have contemplated the gateway called the power of retention of the level of the equality of all phenomena and the gateway called the light of the wisdom of eloquence that elucidates the basis of all phenomena; and therefore miraculous powers have arisen.

source: ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོད་ན་རིགས་ཀྱི་བུ་ཁྱོད་མངོན་སུམ་དུ་བལྟ་བར་འདོད་དམ།
en: Noble one, do you wish to see them?”

source: སྨྲས་པ། འཕགས་མ་འཚལ་ལོ། དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ན་དེ་ལྟར་འདུག་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་སྒོ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་ལ་སྩོགས་པ་དང་།
en: Sudhana answered, “I wish to do so.”
